# AddAggregate Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAggregate..::..AddAggregate Method
IFCAggregate Class See Also
---
Creates a nested aggregate and adds it to the aggregate.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IFCAggregate AddAggregate()
```

Visual Basic
---
```text
Public Function AddAggregate As IFCAggregate
```

Visual C++
---
```text
public:
IFCAggregate^ AddAggregate()
```

# ### Return Value
The nested aggregate.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The aggregate is not valid. |

# See Also
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace